itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @brief   STM32 Smart Garden
  ******************************************************************************
  */
#include "main.h"
#include "webpage.h"

#include "stm32l475e_iot01.h"
#include "stm32l475e_iot01_tsensor.h"
#include "stm32l475e_iot01_hsensor.h"
#include "stm32l475e_iot01_psensor.h"
#include <time.h>
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "C:\Users\Pietro\Desktop\secrets.h"
// --- CONFIGURAZIONE RETE ---
#define PORT           80
#define WIFI_WRITE_TIMEOUT 10000
#define WIFI_READ_TIMEOUT  10000
#define SOCKET             0
#define TIME_PROTOCOL_DELTA 2208988800U

#define LOG(a) printf a

// Buffer globali
static uint8_t http[1024];
static uint8_t IP_Addr[4];

// Handle UART Globale
extern UART_HandleTypeDef hDiscoUart;

#ifdef __GNUC__
int __io_putchar(int ch)
#else
int fputc(int ch, FILE *f)
#endif
{
  HAL_UART_Transmit(&hDiscoUart, (uint8_t *)&ch, 1, 0xFFFF);
  return ch;
}


// --- VARIABILI PROGETTO ---
int cfg_start_hour = 20;
int cfg_duration_min = 10;
uint8_t cfg_days_mask = 127;

int sim_mode_active = 0;
int sim_rain_prob = 30;
int real_rain_prob = -1;
int buf_rain_today = -1;         // dato grezzo API Oggi
int buf_rain_tomorrow = -1;      //  dato grezzo API Domani
int is_showing_tomorrow = 0;     // Flag per la UI (0 = Oggi, 1 = Domani)
uint8_t skip_irrigation = 0;

int smart_mode_active = 0;       // 0 = Manuale, 1 = Smart Auto
int smart_threshold = 60;        // Soglia punteggio per irrigare (Default 60)
int last_calculated_score = 0;   // Per visualizzazione web


#define LAT "45.03"
#define LON "10.74"
#define STOP_MODE_TIMER 600000 //20000


typedef struct {
    uint8_t hours;
    uint8_t minutes;
    uint8_t seconds;
    uint8_t weekday; // 0=Lun, 1=Mar, ..., 6=Dom
} Time_Only_t;

Time_Only_t orario = {0, 0, 0};

uint32_t last_second_tick = 0;
uint32_t last_sync_tick = 0;
uint32_t sync_interval = 3600000;
uint32_t last_http_activity=0;

// Variabili per gestire il risveglio sicuro dallo Stop Mode
volatile uint8_t system_is_sleeping = 0;
volatile uint8_t wifi_irq_pending = 0;

//Salvataggio impostazioni in MEMORIA FLASH
// Indirizzo ultima pagina (STM32L475 1MB = Bank 2, Page 255)
#define FLASH_STORAGE_ADDR 0x080FF800
#define CONFIG_MAGIC 0xCAFEBABE // Codice per capire se i dati sono validi

// Questa struct serve SOLO per salvare/caricare.
typedef struct {
    uint32_t magic_number;
    int saved_start_hour;
    int saved_duration_min;
    uint8_t saved_days_mask;
    int saved_smart_active;
    int saved_smart_threshold;
    int saved_sim_mode;
    int saved_sim_rain_prob;
} FlashData_t;


// Prototipi
static void SystemClock_Config(void);
static WIFI_Status_t SendWebPage(void);
static int wifi_server(void);
static int wifi_connect(void);
static bool WebServerProcess(void);
void UpdateTimeHTTP(Time_Only_t *currentTime);
void IncrementTime(void);
void CheckWeatherForecast(void);
void UpdateIrrigationLogic(void);
int CalculateSmartScore(float t, float h, float p, int rain_prob);
void RefreshSystemState(void);
void ApplyIrrigationControl(void);
void LoadSettings(void);
void SaveSettings(void);
void EXTI15_10_IRQHandler(void);

// Fix printf
int _write(int file, char *ptr, int len) {
    HAL_UART_Transmit(&hDiscoUart, (uint8_t*)ptr, len, 1000);
    return len;
}

int main(void)
{
  HAL_Init();
  SystemClock_Config();


	// --- INIZIALIZZAZIONE PIN RELÈ (PA4 - Arduino D7) ---
	// Abilita il clock per la porta GPIOA
	__HAL_RCC_GPIOA_CLK_ENABLE();

	GPIO_InitTypeDef GPIO_InitStruct = {0};
	GPIO_InitStruct.Pin = GPIO_PIN_4;           // Pin PA4 (Corrisponde a D7)
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP; // Output Push-Pull (Corretto per relè)
	GPIO_InitStruct.Pull = GPIO_NOPULL;         // Nessuna resistenza interna
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;// Bassa velocità

	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	// valvola chiusa (Basso)
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);


	// 1. INIZIALIZZAZIONE SERIALE
	hDiscoUart.Instance = DISCOVERY_COM1;
	hDiscoUart.Init.BaudRate = 115200;
	hDiscoUart.Init.WordLength = UART_WORDLENGTH_8B;
	hDiscoUart.Init.StopBits = UART_STOPBITS_1;
	hDiscoUart.Init.Parity = UART_PARITY_NONE;
	hDiscoUart.Init.Mode = UART_MODE_TX_RX;
	hDiscoUart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
	hDiscoUart.Init.OverSampling = UART_OVERSAMPLING_16;
	hDiscoUart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
	hDiscoUart.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

	BSP_COM_Init(COM1, &hDiscoUart);

	printf("\r\n\r\n==================================\r\n");
	printf("   SMART GARDEN BOOTING... \r\n");
	printf("==================================\r\n");

	// INIZIALIZZAZIONE SENSORI
	printf("Init Sensori... ");

	if(BSP_HSENSOR_Init() != HSENSOR_OK) printf("[ERR HUM] ");
	else printf("[HUM OK] ");

	if(BSP_TSENSOR_Init() != TSENSOR_OK) printf("[ERR TMP] ");
	else printf("[TMP OK] ");

	if(BSP_PSENSOR_Init() != PSENSOR_OK) printf("[ERR PRS] ");
	else printf("[PRS OK] ");

	printf("\r\n");

	LoadSettings();

	HAL_Delay(500);

	// Test lettura valori
	float t_test = BSP_TSENSOR_ReadTemp();
	float h_test = BSP_HSENSOR_ReadHumidity();
	printf("Test Lettura: T=%.2f H=%.2f\r\n", t_test, h_test);
	if(t_test == 0.0f) printf("ATTENZIONE: Se leggi 0.00 controlla il flag -u _printf_float nel linker!\r\n");

	BSP_LED_Init(LED2);

	// INIZIALIZZA IL BOTTONE BLU PER GENERARE INTERRUPT
	BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

	wifi_server();
}

static int wifi_start(void) {
  if(WIFI_Init() ==  WIFI_STATUS_OK) return 0;
  return -1;
}

int wifi_connect(void) {
  wifi_start();
  LOG(("\nConnessione WiFi a %s...\n", SSID));
  if( WIFI_Connect(SSID, PASSWORD, WIFI_ECN_WPA_WPA2_PSK) == WIFI_STATUS_OK) {
    WIFI_GetIP_Address(IP_Addr, sizeof(IP_Addr));
    LOG(("> CONNESSO! IP: %d.%d.%d.%d\n", IP_Addr[0], IP_Addr[1], IP_Addr[2], IP_Addr[3]));
    return 0;
  }
  LOG(("Errore Connessione WiFi!\n"));
  return -1;
}

int wifi_server(void)
{
  bool StopServer = false;
  if (wifi_connect()!=0) return -1;

  LOG(("Sincronizzazione NTP e Meteo...\n"));
  UpdateTimeHTTP(&orario);
  CheckWeatherForecast();
  UpdateIrrigationLogic();
  RefreshSystemState();
  ApplyIrrigationControl();

  last_sync_tick = HAL_GetTick();
  last_second_tick = HAL_GetTick();

  WIFI_StartServer(SOCKET, WIFI_TCP_PROTOCOL, 1, "", PORT);
  LOG(("Server HTTP attivo su porta 80.\n"));
  last_http_activity = HAL_GetTick(); // Inizializza il timer di inattività

  do {
        // LOGICA DI RISPARMIO ENERGETICO (Attivazione col Bottone)
        bool is_sleeping = (HAL_GetTick() - last_http_activity > STOP_MODE_TIMER);

        if (is_sleeping) {
			LOG(("\nEntrata in STOP Mode. Premi il bottone blu per risvegliare...\n"));

			// Chiusura del socket server in modo sicuro
			WIFI_StopServer(SOCKET);
			HAL_Delay(300);

