itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
			// Spegnimento interrupt Wi-Fi per evitare risvegli indesiderati
			HAL_NVIC_DisableIRQ(EXTI1_IRQn);

			//Abilita stop mode
			HAL_SuspendTick();
			HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);


			// RISVEGLIO
			SystemClock_Config();
			HAL_ResumeTick();

			// Riattivazione dell'interrupt del Wi-Fi
			HAL_NVIC_EnableIRQ(EXTI1_IRQn);
			HAL_Delay(300);

			LOG((">>>Risveglio da STOP Mode. Server di nuovo online.\n"));

			UpdateTimeHTTP(&orario);
			HAL_Delay(500);

			// riapertura del Server Web
			if (WIFI_StartServer(SOCKET, WIFI_TCP_PROTOCOL, 1, "", PORT) == WIFI_STATUS_OK) {
				LOG(("Server riaperto con successo.\n"));
			} else {
				LOG(("ATTENZIONE: Errore riapertura Server.\n"));
			}

			last_http_activity = HAL_GetTick();
			continue;
		}


        uint8_t RemoteIP[4];
        uint16_t RemotePort;

        if (HAL_GetTick() - last_second_tick >= 1000) {
            last_second_tick += 1000;
            IncrementTime();
            ApplyIrrigationControl();
        }

        if (HAL_GetTick() - last_sync_tick >= sync_interval) {
            LOG(("\n--- Auto Sync ---\n"));
            UpdateTimeHTTP(&orario);
            CheckWeatherForecast();
            UpdateIrrigationLogic();
            RefreshSystemState();
            last_sync_tick = HAL_GetTick();
        }


        if (WIFI_STATUS_OK == WIFI_WaitServerConnection(SOCKET, 1000, RemoteIP, sizeof(RemoteIP), &RemotePort)) {
            last_http_activity = HAL_GetTick(); // Client connesso: resetta il timer di inattività
            StopServer = WebServerProcess();
            WIFI_CloseServerConnection(SOCKET);
            HAL_Delay(500);
        }

    } while(StopServer == false);

  WIFI_StopServer(SOCKET);
  return 0;
}

static bool WebServerProcess(void)
{
    uint16_t respLen;
    static uint8_t resp[1024];
    bool stopserver = false;

    if (WIFI_STATUS_OK == WIFI_ReceiveData(SOCKET, resp, 1000, &respLen, WIFI_READ_TIMEOUT))
    {
        if (respLen > 0)
        {
            if (respLen < 1024) resp[respLen] = '\0'; else resp[1023] = '\0';

            if (strstr((char *)resp, "GET")) {
                SendWebPage();
            }
            else if (strstr((char *)resp, "POST")) {
                LOG(("POST Ricevuto. Aggiorno configurazione...\n"));
                char *p;

                p = strstr((char *)resp, "cfg_hour=");
                if (p) cfg_start_hour = atoi(p + 9);

                p = strstr((char *)resp, "cfg_dur=");
                if (p) cfg_duration_min = atoi(p + 8);


                if (strstr((char *)resp, "smart_active=1")) {
                    smart_mode_active = 1;
                } else {
                    smart_mode_active = 0;
                }

                char *p_smart = strstr((char *)resp, "smart_th=");
                if (p_smart) smart_threshold = atoi(p_smart + 9);


                cfg_days_mask = 0;
                if (strstr((char *)resp, "day_0=1")) cfg_days_mask |= (1<<0);
                if (strstr((char *)resp, "day_1=1")) cfg_days_mask |= (1<<1);
                if (strstr((char *)resp, "day_2=1")) cfg_days_mask |= (1<<2);
                if (strstr((char *)resp, "day_3=1")) cfg_days_mask |= (1<<3);
                if (strstr((char *)resp, "day_4=1")) cfg_days_mask |= (1<<4);
                if (strstr((char *)resp, "day_5=1")) cfg_days_mask |= (1<<5);
                if (strstr((char *)resp, "day_6=1")) cfg_days_mask |= (1<<6);

                if (strstr((char *)resp, "sim_mode=1")) {
                    sim_mode_active = 1;
                    p = strstr((char *)resp, "sim_rain=");
                    if (p) sim_rain_prob = atoi(p + 9);
                } else {
                    sim_mode_active = 0;
                }

                RefreshSystemState();
                ApplyIrrigationControl();
                SaveSettings();
                SendWebPage();
            }
        }
    }
    return stopserver;
}

void UpdateIrrigationLogic(void) {
    int prob_to_check = (sim_mode_active) ? sim_rain_prob : real_rain_prob;
    if(prob_to_check == -1) prob_to_check = 0;

    if (prob_to_check > 60) {
        if(skip_irrigation == 0) LOG(("LOGICA: Pioggia alta (%d%%) -> STOP Irrigazione\n", prob_to_check));
        skip_irrigation = 1;
    } else {
        if(skip_irrigation == 1) LOG(("LOGICA: Pioggia bassa (%d%%) -> OK Irrigazione\n", prob_to_check));
        skip_irrigation = 0;
    }
}

// Funzione per aggiornare sensori e logica decisionale
void RefreshSystemState(void) {
    //Lettura Sensori (per avere dati freschi su Score e Dashboard)
    float current_T = BSP_TSENSOR_ReadTemp();
    float current_H = BSP_HSENSOR_ReadHumidity();
    float current_P = BSP_PSENSOR_ReadPressure();

    //Calcolo Logica Temporale (Oggi vs Domani)
    int irrigation_end_minute = cfg_start_hour * 60 + cfg_duration_min;
    int current_minute_abs = orario.hours * 60 + orario.minutes;

    if (current_minute_abs >= irrigation_end_minute) {
        is_showing_tomorrow = 1;
        real_rain_prob = buf_rain_tomorrow;
    } else {
        is_showing_tomorrow = 0;
        real_rain_prob = buf_rain_today;
    }

    //Determina probabilità attiva (Simulata o Reale)
    int prob_to_use = (sim_mode_active) ? sim_rain_prob : real_rain_prob;
    if(prob_to_use == -1) prob_to_use = 0;

    UpdateIrrigationLogic();

    //Calcola Score Smart (Logica AI)
    last_calculated_score = CalculateSmartScore(current_T, current_H, current_P, prob_to_use);
}

void ApplyIrrigationControl(void) {
    int start_irrigation = 0;

    int is_time_window = (orario.hours == cfg_start_hour && orario.minutes < cfg_duration_min);

    if (is_time_window) {

        if (smart_mode_active) {
            // Logica Smart: Score > Soglia
            if (last_calculated_score >= smart_threshold) {
                start_irrigation = 1;
            }
        } else {
            int is_day_active = (cfg_days_mask & (1 << orario.weekday));
            if (is_day_active && skip_irrigation == 0) {
                start_irrigation = 1;
            }
        }
    }

    if (start_irrigation) {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_SET);
        BSP_LED_On(LED2);
    } else {
        HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
        BSP_LED_Off(LED2);
    }
}


