itsmrma/STM32CentralinaGettiniWiFI/Application/User/main.c
          "<div style='margin: 15px 0; padding: 10px; background: #ecf0f1; border-radius: 5px; text-align: center;'>"
            "<div style='font-size: 0.9em; color: #7f8c8d;'>Indice Bisogno Idrico (%s)</div>"
            "<div style='font-size: 2em; font-weight: bold; color: %s;'>%d <span style='font-size:0.5em'>/ 100</span></div>"
            "<div style='font-size: 0.7em;'>Basato su: Umidità, Temp, Pressione e Pioggia (%s)</div>"
          "</div>"

          "<label>Soglia Attivazione (Default 60):</label>"
          "<div style='display:flex; gap:10px; align-items:center;'>"
            "<input type='number' name='smart_th' value='%d' min='0' max='200' style='width:80px'>"
            "<span style='font-size:0.8em; color:#7f8c8d;'>Più alto = Irrigazione meno frequente</span>"
          "</div>"
        "</div>",
        smart_mode_active ? "checked" : "",
        time_label,
        score_color,
        last_calculated_score,
        time_label,
        smart_threshold
    );
    WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);

  // CHUNK 6: Pannello Simulazione, Submit e Footer
  sprintf((char *)http,
    "<div class='panel sim-panel'>"
      "<h3><span class='material-icons'>tune</span> Simulatore</h3>"
      "<div class='toggle-wrap'>"
        "<input type='checkbox' name='sim_mode' value='1' %s>"
        "<label>Usa dati manuali</label>"
      "</div>"
      "<label>Pioggia Simulata (%%):</label>"
      "<input type='number' name='sim_rain' value='%d' min='0' max='100'>"
      "<p style='margin:5px 0 0; font-size:0.8em; color:#d35400;'>Smart Mode usa questo valore se attivo.</p>"
    "</div>",
    sim_mode_active ? "checked" : "",
    sim_rain_prob
  );

  strcat((char *)http, "<input type='submit' value='SALVA IMPOSTAZIONI' class='btn-save'>");
  strcat((char *)http, "</form>");

  // Footer finale
  strcat((char *)http, HTML_FOOTER);

  WIFI_SendData(0, (uint8_t *)http, strlen((char *)http), &SentDataLength, WIFI_WRITE_TIMEOUT);

  return ret;
}

static void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.MSICalibrationValue = RCC_MSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLP = 7;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4);
}


// Funzione per convertire mese in numero
uint8_t GetMonthNum(char *monthStr) {
    if (strstr(monthStr, "Jan")) return 1;
    if (strstr(monthStr, "Feb")) return 2;
    if (strstr(monthStr, "Mar")) return 3;
    if (strstr(monthStr, "Apr")) return 4;
    if (strstr(monthStr, "May")) return 5;
    if (strstr(monthStr, "Jun")) return 6;
    if (strstr(monthStr, "Jul")) return 7;
    if (strstr(monthStr, "Aug")) return 8;
    if (strstr(monthStr, "Sep")) return 9;
    if (strstr(monthStr, "Oct")) return 10;
    if (strstr(monthStr, "Nov")) return 11;
    if (strstr(monthStr, "Dec")) return 12;
    return 1; // Default
}

// Funzione per convertire giorno in numero (0=Lun,...,6=Dom)
uint8_t GetWeekdayNum(char *dayStr) {
    if (strstr(dayStr, "Mon")) return 0;
    if (strstr(dayStr, "Tue")) return 1;
    if (strstr(dayStr, "Wed")) return 2;
    if (strstr(dayStr, "Thu")) return 3;
    if (strstr(dayStr, "Fri")) return 4;
    if (strstr(dayStr, "Sat")) return 5;
    if (strstr(dayStr, "Sun")) return 6;
    return 0; // Default
}

void UpdateTimeHTTP(Time_Only_t *currentTime) {
    uint8_t ipAddr[4] = {0};

    char recvBuf[1024] = {0};
    uint16_t len = 0;

    printf("\n--- TIME SYNC (HTTP Port 80) ---\n");

    // DNS Resolve Google
    printf("1. DNS Resolve (www.google.com)... ");


    if (WIFI_GetHostAddress("www.google.com", ipAddr, 4) != WIFI_STATUS_OK) {
        printf("FALLITO (DNS)\n");
        return;
    }



    printf("OK (%d.%d.%d.%d)\n", ipAddr[0], ipAddr[1], ipAddr[2], ipAddr[3]);

    // Connessione TCP Porta 80
    WIFI_CloseClientConnection(1);
    HAL_Delay(200);

    if (WIFI_OpenClientConnection(1, WIFI_TCP_PROTOCOL, "www.google.com", ipAddr, 80, 0) == WIFI_STATUS_OK) {
        printf("Connesso. Invio richiesta HTTP HEAD...\n");


        char *request = "HEAD / HTTP/1.1\r\nHost: www.google.com\r\nConnection: close\r\n\r\n";
        uint16_t sentLen = 0;

        WIFI_SendData(1, (uint8_t*)request, strlen(request), &sentLen, 1000);

        // Ricezione Risposta
        // Diamo tempo al server di processare
        HAL_Delay(500);

        // Leggiamo tutto in una volta (buffer da 1024 è sufficiente per gli header)
        WIFI_Status_t status = WIFI_ReceiveData(1, (uint8_t*)recvBuf, 1023, &len, 2000);

        if (status == WIFI_STATUS_OK && len > 0) {
            recvBuf[len] = '\0';

            // Parsing della stringa "Date:"
            // Formato standard: "Date: Sat, 31 Jan 2026 14:24:42 GMT"
            char *datePtr = strstr(recvBuf, "Date: ");

            if (datePtr != NULL) {
                // Variabili temporanee per il parsing
                char wdayStr[5] = {0};
                char monthStr[5] = {0};
                int day, year, h, m, s;

                // Formato stringa: "Wdy, DD Mon YYYY HH:MM:SS GMT"
                // Esempio: "Sat, 31 Jan 2026 14:24:42"
                if (sscanf(datePtr + 6, "%3s, %d %3s %d %d:%d:%d",
                           wdayStr, &day, monthStr, &year, &h, &m, &s) == 7) {

                    // L'ora ricevuta è GMT
                    // +1 per l'Italia o +2 per l'ora legale
                    int fuso_orario = 2;
                    h += fuso_orario;
                    if (h >= 24) {
                        h -= 24;
                    }

